# Pandas 데이터 합성
pandas는 두 개 이상의 데이터프레임을 하나로 합치게 하는 합성을 지원

In [1]:
import pandas as pd
import numpy as np

## merge
merge : 두 데이터 프레임의 공통 열 / 인덱스 기준으로 데이터베이스의 테이블 조인과 같이, 두 개의 테이블을 합친다.

In [7]:
# ex 1)

df1 = pd.DataFrame({'key': ['b','b','a','c','a','a','b'],'data1': range(7)})
df1

# data1 : 0~6 인덱스, 'key'라는 열을 만듬

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [8]:
df2 = pd.DataFrame({'key':['a','b','d'], 'data2':range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [13]:
pd.merge(df1,df2)

# 공통 열 'key' 기준으로 데이터를 합친다.
## 공통 열은 a,b로, 
## data1, keyb -> 0,1,6값을 인덱스 0,1,2에 / data2, keyb -> 2 값을 인덱스 0,1,2에 똑같이 분배

## data2, keya -> 2,4,5값을 인덱스 3,4,5에 / data2, keya -> 0 값을 인덱스 3,4,5에 똑같이 분배

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [15]:
pd.merge(df1,df2, how='outer')

# null이 있어도 양쪽 데이터를 보여줌 (data2에는 c가 없음)

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [17]:
pd.merge(df1,df2,how='left')

# 보여줄 데이터프레임 기준 (how=right or left)

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [18]:
# ex 2)

df1= pd.DataFrame({'key1':['foo','foo','bar'],
                   'key2':['one','two','one'],
                  'lval':[1,2,3]})

df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [23]:
df2= pd.DataFrame({'key1':['foo','foo','bar','bar'],
                   'key2':['one','two','one','two'],
                  'rval':[4,5,6,7]})
df2

  key1 key2  rval
0  foo  one     4
1  foo  two     5
2  bar  one     6
3  bar  two     7

In [25]:
pd.merge(df1,df2,how='outer')

# 이름 같은 건 다 합침

  key1 key2  lval  rval
0  foo  one   1.0     4
1  foo  two   2.0     5
2  bar  one   3.0     6
3  bar  two   NaN     7

In [27]:
pd.merge(df1,df2,on=['key1','key2'],how='outer')

# 기준 열 명시(on 인수)

  key1 key2  lval  rval
0  foo  one   1.0     4
1  foo  two   2.0     5
2  bar  one   3.0     6
3  bar  two   NaN     7

In [29]:
pd.merge(df1,df2,on='key1')

# 기준 열이 아니면서 이름이 같은 열에는, 다른 접미사가 붙는다.
# suffixes 인수로 접미사 설정 가능하다. suffixes=('_left', 'right')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    two     5
2  foo    two     2    one     4
3  foo    two     2    two     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [35]:
# merge ex 3)

df1 = pd.DataFrame({'key1':['foo','foo','bar'],
                   'key2': ['one','two','one'],
                   'lval' : [1,2,3]})
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [36]:
df2= pd.DataFrame({'k1':['foo','foo','bar','bar'],
                   'k2':['one','two','one','two'],
                  'rval':[4,5,6,7]})
df2

    k1   k2  rval
0  foo  one     4
1  foo  two     5
2  bar  one     6
3  bar  two     7

In [32]:
# 기준 열을 각각의 데이터프레임에 다르게 정리함.
# left_on, right_on

In [39]:
pd.merge(df1,df2,left_on='key1', right_on="k1")

  key1 key2  lval   k1   k2  rval
0  foo  one     1  foo  one     4
1  foo  one     1  foo  two     5
2  foo  two     2  foo  one     4
3  foo  two     2  foo  two     5
4  bar  one     3  bar  one     6
5  bar  one     3  bar  two     7

In [41]:
# merge ex 4)

df1 = pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [42]:
df2 = pd.DataFrame({'group_val':[3.5,7]}, index=['a','b'])
df2

   group_val
a        3.5
b        7.0

In [43]:
pd.merge(df1, df2, left_on='key', right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [45]:
# merge ex 5)

df5 = pd.DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                   'key2':[2000,2001,2002,2001,2002],
                   'data': np.arange(5.)})
df5

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [48]:
df6 = pd.DataFrame(np.arange(12).reshape((6,2)),
                   index=[['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                          [2001,2000,2000,2000,2001,2002]],
                   columns=['event1','event2'])

df6

# Nevada, Ohio끼리 서로 묶이게 됨.

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [51]:
pd.merge(df5,df6, left_on=['key1','key2'], right_index = True)

# key1, 2를 기준열로
## right_index : 오른쪽 데이터프레임의 인덱스를 조인 키로 사용한다.

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

In [52]:
# merge ex 6)

df1 = pd.DataFrame([[1., 2.],[3.,4.] , [5., 6.]],
                  index=['a','c','e'],
                  columns = ['Ohio','Nevada'])

df1

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [53]:
df2 = pd.DataFrame([[7.,8.,],[9.,10.], [11.,12.], [13., 14.]],
                  index = ['b','c','d','e'],
                  columns = ['Missouri','Alabama'])
df2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [54]:
pd.merge(df1, df2, how='outer', left_index=True, right_index = True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

## join 메서드
merge 명령어 대신 join 메서드를 사용할 수도 있다.

In [56]:
df1.join(df2,how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

## Concat
기준 열을 사용하지 않고 단순 데이터 추가.

axis=0은 아래에 행 추가, axis=1은 인덱스 기준으로 옆으로 데이터 추가

In [57]:
s1 = pd.Series([0,1], index = ['a','b'])
s2 = pd.Series([2,3,4], index = ['c','d','e'])
s3 = pd.Series([5,6], index = ['f','g'])

In [59]:
print s1
print s2
print s3

a    0
b    1
dtype: int64
c    2
d    3
e    4
dtype: int64
f    5
g    6
dtype: int64

In [60]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [61]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [62]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [63]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [64]:
pd.concat([df1, df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0